import { ProjectData } from '../types/project';

export const INITIAL_PROJECT_DATA: ProjectData = {
  schoolYear: '2023 - 2024',
  name: 'أمين سنوسي',
  academy: 'الجهة الشرقية',
  directorate: 'تاوريرت',
  employeeNumber: '1443756',
  framework: 'مفتش التعليم الثانوي',
  subject: 'التربية البدنية والرياضية',
  appointmentDate: '2017/09/06',
  employmentDate: '2007/09/05',
  axes: [
    {
      id: 'axis-1',
      title: 'المحور الأول: التأطير التربوي',
      activities: [
        {
          id: 'a1-1',
          activityType: 'الزيارات الصفية',
          subject: 'تشخيص الإكراهات والصعوبات التي يواجهها الأساتذة .',
          executionPeriod: 'طيلة السنة الدراسية',
          targetGroup: '-الأساتذة المكلفون بتدريس المادة\n-الملتحقون الجدد بالمديرية\n-بقية الأساتذة حسب الحاجة',
          notes: 'الأولوية للأساتذة الجدد. وكذا الأساتذة المقبلين على الترقية.'
        },
        {
          id: 'a1-2',
          activityType: 'الزيارات الصفية',
          subject: 'مراقبة الوثائق التربوية.',
          executionPeriod: 'طيلة السنة الدراسية',
          targetGroup: '-الأساتذة المكلفون بتدريس المادة\n-الملتحقون الجدد بالمديرية\n-بقية الأساتذة حسب الحاجة',
          notes: 'الأولوية للأساتذة الجدد. وكذا الأساتذة المقبلين على الترقية.'
        },
        {
          id: 'a1-3',
          activityType: 'الزيارات الصفية',
          subject: 'تتبع ومراقبة عملية تخطيط الأستاذ للدرس',
          executionPeriod: 'طيلة السنة الدراسية',
          targetGroup: '-الأساتذة المكلفون بتدريس المادة\n-الملتحقون الجدد بالمديرية\n-بقية الأساتذة حسب الحاجة',
          notes: 'الأولوية للأساتذة الجدد. وكذا الأساتذة المقبلين على الترقية.'
        },
        {
          id: 'a1-4',
          activityType: 'الزيارات الصفية',
          subject: 'تتبع ومراقبة أساليب تدبير جماعة القسم',
          executionPeriod: 'طيلة السنة الدراسية',
          targetGroup: '-الأساتذة المكلفون بتدريس المادة\n-الملتحقون الجدد بالمديرية\n-بقية الأساتذة حسب الحاجة',
          notes: 'الأولوية للأساتذة الجدد. وكذا الأساتذة المقبلين على الترقية.'
        },
        {
          id: 'a1-5',
          activityType: 'الزيارات الصفية',
          subject: 'تتبع ومراقبة اليات تقويم التعلمات',
          executionPeriod: 'طيلة السنة الدراسية',
          targetGroup: '-الأساتذة المكلفون بتدريس المادة\n-الملتحقون الجدد بالمديرية\n-بقية الأساتذة حسب الحاجة',
          notes: 'الأولوية للأساتذة الجدد. وكذا الأساتذة المقبلين على الترقية.'
        },
        {
          id: 'a1-6',
          activityType: 'الزيارات الصفية',
          subject: 'تشخيص ومراقبة اسهام التربية البدنية في الحياة المدرسية.',
          executionPeriod: 'طيلة السنة الدراسية',
          targetGroup: '-الأساتذة المكلفون بتدريس المادة\n-الملتحقون الجدد بالمديرية\n-بقية الأساتذة حسب الحاجة',
          notes: 'الأولوية للأساتذة الجدد. وكذا الأساتذة المقبلين على الترقية.'
        },
        {
          id: 'a1-7',
          activityType: 'اللقاءات والندوات التربوية',
          subject: 'تدبير الجهد البدني وتنظيم جماعات القسم الفزيولوجية test luc leger.',
          executionPeriod: 'خلال الأسدوس الأول',
          targetGroup: 'جميع أساتذة مادة التربية البدنية بالتعليم الثانوي الإعدادي والتأهيلي.',
          notes: 'لتجنب تنقل الأساتذة لمسافات طويلة سيتم تنظيم كل ندوة مرتين لتغطية كل منطقتي تاوريرت والعيون.'
        },
        {
          id: 'a1-8',
          activityType: 'اللقاءات والندوات التربوية',
          subject: 'تنظيم حلقة الكرة الطائرة ودعم التعلمات الاساس.',
          executionPeriod: 'خلال الأسدوس الأول',
          targetGroup: 'جميع أساتذة مادة التربية البدنية بالتعليم الثانوي الإعدادي والتأهيلي.',
          notes: 'لتجنب تنقل الأساتذة لمسافات طويلة سيتم تنظيم كل ندوة مرتين لتغطية كل منطقتي تاوريرت والعيون.'
        },
        {
          id: 'a1-9',
          activityType: 'اللقاءات والندوات التربوية',
          subject: 'القسم المعكوس كنموذج تعليمي لتدبير زمن التمرن الرياضي',
          executionPeriod: 'خلال الأسدوس الثاني',
          targetGroup: 'جميع أساتذة مادة التربية البدنية بالتعليم الثانوي الإعدادي والتأهيلي.',
          notes: 'لتجنب تنقل الأساتذة لمسافات طويلة سيتم تنظيم كل ندوة مرتين لتغطية كل منطقتي تاوريرت والعيون.'
        },
        {
          id: 'a1-10',
          activityType: 'اللقاءات والندوات التربوية',
          subject: 'اعداد شبكات التقويم وفق التوجيهات التربوية الخاصة بالمادة (رياضات التحرر والتعقب).',
          executionPeriod: 'خلال الأسدوس الثاني',
          targetGroup: 'جميع أساتذة مادة التربية البدنية بالتعليم الثانوي الإعدادي والتأهيلي.',
          notes: 'لتجنب تنقل الأساتذة لمسافات طويلة سيتم تنظيم كل ندوة مرتين لتغطية كل منطقتي تاوريرت والعيون.'
        },
        {
          id: 'a1-11',
          activityType: 'الدروس التجريبية',
          subject: 'دروس تطبيقية للمحتوى النظري للندوات التربوية في رياضات مختلفة.',
          executionPeriod: 'طيلة السنة الدراسية',
          targetGroup: 'جميع أساتذة مادة التربية البدنية بالتعليم الثانوي الإعدادي والتأهيلي.',
          notes: 'لتجنب تنقل الأساتذة لمسافات طويلة سيتم تنظيم الدروس التطبيقية في منطقتي التفتيش التربوية.'
        },
        {
          id: 'a1-12',
          activityType: 'مجالس المؤسسة',
          subject: 'استثمار التقارير',
          executionPeriod: '',
          targetGroup: '',
          notes: 'في إطار المجلس الإقليمي.'
        }
      ]
    },
    {
      id: 'axis-2',
      title: 'المحور الثاني: المراقبة التربوية',
      activities: [
        {
          id: 'a2-1',
          activityType: 'تتبع ومواكبة الدخول المدرسي',
          subject: 'حضور الاجتماعات الاقليمية الخاصة بتحضير الدخول المدرسي 2019/2020.',
          executionPeriod: 'شتنبر / أكتوبر 2019 وكلما دعت الضرورة.',
          targetGroup: 'المؤسسات التعليمة الإعدادية والتأهيلية بالمديرية الإقليمية',
          notes: 'تحرر تقارير عن تتبع الدخول المدرسي. (بناءً على المقرر الوزاري وبناءً على تكليف في الموضوع).'
        },
        {
          id: 'a2-2',
          activityType: 'تتبع ومواكبة الدخول المدرسي',
          subject: 'تتبع ومواكبة الدخول المدرسي المنظم من طرف المفتشية العامة للوزارة.',
          executionPeriod: 'شتنبر / أكتوبر 2019 وكلما دعت الضرورة.',
          targetGroup: 'المؤسسات التعليمة الإعدادية والتأهيلية بالمديرية الإقليمية',
          notes: 'تحرر تقارير عن تتبع الدخول المدرسي. (بناءً على المقرر الوزاري وبناءً على تكليف في الموضوع).'
        },
        {
          id: 'a2-3',
          activityType: 'تتبع ومواكبة الدخول المدرسي',
          subject: 'تتبع عملية توزيع الأساتذة وسد الخصاص .',
          executionPeriod: 'شتنبر / أكتوبر 2019 وكلما دعت الضرورة.',
          targetGroup: 'المؤسسات التعليمة الإعدادية والتأهيلية بالمديرية الإقليمية',
          notes: 'تحرر تقارير عن تتبع الدخول المدرسي. (بناءً على المقرر الوزاري وبناءً على تكليف في الموضوع).'
        },
        {
          id: 'a2-4',
          activityType: 'مراقبة الوثائق التربوية',
          subject: 'تتبع إسناد جداول الحصص.',
          executionPeriod: 'شتنبر / أكتوبر 2019 وكلما دعت الضرورة.',
          targetGroup: 'أساتذة مادة التربية البدنية بالتعليم الثانوي الاعدادي والتأهيلي',
          notes: 'تتم المصادقة على جداول الحصص بناء على التوجيهات التربوية ذات الصلة.'
        },
        {
          id: 'a2-5',
          activityType: 'مراقبة الوثائق التربوية',
          subject: 'الاطلاع على جداول الحصص تدارسها والمصادقة عليها.',
          executionPeriod: 'شتنبر / أكتوبر 2019 وكلما دعت الضرورة.',
          targetGroup: 'أساتذة مادة التربية البدنية بالتعليم الثانوي الاعدادي والتأهيلي',
          notes: 'تتم المصادقة على جداول الحصص بناء على التوجيهات التربوية ذات الصلة.'
        },
        {
          id: 'a2-6',
          activityType: 'مراقبة الوثائق التربوية',
          subject: 'مراقبة الوثائق التربوية.',
          executionPeriod: 'شتنبر / أكتوبر 2019 وكلما دعت الضرورة.',
          targetGroup: 'أساتذة مادة التربية البدنية بالتعليم الثانوي الاعدادي والتأهيلي',
          notes: 'تتم المصادقة على جداول الحصص بناء على التوجيهات التربوية ذات الصلة.'
        },
        {
          id: 'a2-7',
          activityType: 'التفتيشات',
          subject: 'تقويم إجمالي لعمل الأستاذ: تطور ممارسته التربوية، اهتمامه بالوثائق التربوية، استفادته من تأطيرات وتوجيهات سابقة.',
          executionPeriod: 'طيلة السنة الدراسية',
          targetGroup: 'أساتذة مادة التربية البدنية بالتعليم الثانوي الاعدادي والتأهيلي',
          notes: 'الأولوية للمترشحين في لوائح الترقية بالاختيار والمترشحين للكفاءة والامتحانات المهنية.'
        },
        {
          id: 'a2-8',
          activityType: 'التفتيشات',
          subject: 'تتبع المراقبة المستمرة.',
          executionPeriod: 'طيلة السنة الدراسية',
          targetGroup: 'أساتذة مادة التربية البدنية بالتعليم الثانوي الاعدادي والتأهيلي',
          notes: 'الأولوية للمترشحين في لوائح الترقية بالاختيار والمترشحين للكفاءة والامتحانات المهنية.'
        },
        {
          id: 'a2-9',
          activityType: 'التفتيشات',
          subject: 'تتبع إنجاز البرامج الدراسية.',
          executionPeriod: 'طيلة السنة الدراسية',
          targetGroup: 'أساتذة مادة التربية البدنية بالتعليم الثانوي الاعدادي والتأهيلي',
          notes: 'الأولوية للمترشحين في لوائح الترقية بالاختيار والمترشحين للكفاءة والامتحانات المهنية.'
        }
      ]
    },
    {
      id: 'axis-3',
      title: 'المحور الثالث: الرياضة المدرسية',
      activities: [
        {
          id: 'a3-1',
          activityType: 'العدو الريفي المدرسي',
          subject: 'تنظيم البطولة الاقليمية',
          executionPeriod: '2019/10/30',
          targetGroup: 'تلاميذ مؤسسات المديرية الاقليمية',
          notes: 'تنظم بطولات العدو الريفي المدرسي على صعيد المؤسسات التعليمية قبل تاريخ 15 أكتوبر 2019 كحد أقصى.'
        },
        {
          id: 'a3-2',
          activityType: 'العدو الريفي المدرسي',
          subject: 'تنظيم بطولة الجهة',
          executionPeriod: 'لم تحدد بعد',
          targetGroup: 'تلاميذ مؤسسات الأكاديمية المؤهلين',
          notes: 'المؤهلون على صعيد الأكاديمية'
        },
        {
          id: 'a3-3',
          activityType: 'العدو الريفي المدرسي',
          subject: 'المشاركة في نهائيات البطولة الوطنية',
          executionPeriod: 'المرحلة 1: 25-27 دجنبر 2019\nالمرحلة 2: 27-29 دجنبر2012',
          targetGroup: 'المؤهلون على صعيد الأكاديمية',
          notes: ''
        },
        {
          id: 'a3-4',
          activityType: 'الرياضات الجماعية',
          subject: 'تنظيم البطولة الاقليمية',
          executionPeriod: 'لم تحدد بعد',
          targetGroup: 'فرق مؤسسات المديرية الاقليمية',
          notes: 'تبقى تواريخ البطولات الجهوية مؤقتة الى حين صدور البرنامج الجهوي لبطولات الرياضة المدرسية'
        },
        {
          id: 'a3-5',
          activityType: 'الرياضات الجماعية',
          subject: 'المشاركة في البطولة الجهوية',
          executionPeriod: 'لم تحدد بعد',
          targetGroup: 'الفرق المؤهلة من البطولة الاقليمية',
          notes: 'تبقى تواريخ البطولات الجهوية مؤقتة الى حين صدور البرنامج الجهوي لبطولات الرياضة المدرسية'
        },
        {
          id: 'a3-6',
          activityType: 'الرياضات الجماعية',
          subject: 'المشاركة في بطولة ما بين الجهات',
          executionPeriod: 'لم تحدد بعد',
          targetGroup: 'فرق المديرية المؤهلة من البطولة الجهوية',
          notes: 'فرق المديرية المؤهلة من بطولة ما بين الجهات'
        },
        {
          id: 'a3-7',
          activityType: 'الرياضات الجماعية',
          subject: 'المشاركة في نهائيات البطولة الوطنية',
          executionPeriod: 'من 28 الى 31 مارس 2020',
          targetGroup: 'فرق المديرية المؤهلة من بطولة ما بين الجهات',
          notes: ''
        },
        {
          id: 'a3-8',
          activityType: 'البطولة الوطنية المدرسية الخاصة بالتعليم الابتدائي والمراكز الرياضية',
          subject: 'تنظيم بطولة المديرية الاقليمية',
          executionPeriod: 'لم تحدد بعد',
          targetGroup: 'تلاميذ المؤسسات الابتدائية بالمديرية الاقليمية',
          notes: 'تبقى تواريخ البطولات الجهوية مؤقتة الى حين صدور البرنامج الجهوي لبطولات الرياضة المدرسية'
        },
        {
          id: 'a3-9',
          activityType: 'البطولة الوطنية المدرسية الخاصة بالتعليم الابتدائي والمراكز الرياضية',
          subject: 'المشاركة في البطولة الجهوية',
          executionPeriod: 'لم تحدد بعد',
          targetGroup: 'التلاميذ المؤهلين من بطولة المديرية',
          notes: 'تبقى تواريخ البطولات الجهوية مؤقتة الى حين صدور البرنامج الجهوي لبطولات الرياضة المدرسية'
        },
        {
          id: 'a3-10',
          activityType: 'البطولة الوطنية المدرسية الخاصة بالتعليم الابتدائي والمراكز الرياضية',
          subject: 'المشاركة في نهائيات البطولة الوطنية بأكادير',
          executionPeriod: 'من 27 الى 30 يونيو 2020',
          targetGroup: 'التلاميذ المؤهلين من بطولة الجهة',
          notes: ''
        },
        {
          id: 'a3-11',
          activityType: 'أنشطة أخرى',
          subject: 'تكوين في مجال الاسعافات الاولية',
          executionPeriod: 'الأسدوس الثاني',
          targetGroup: 'أساتذة التربية البدنية',
          notes: 'ستبرمج الأنشطة بمنطقتين تربويتين'
        },
        {
          id: 'a3-12',
          activityType: 'أنشطة أخرى',
          subject: 'تكوين في مجال التحكيم للرياضات الجماعية (كرة الطائرة)',
          executionPeriod: 'الأسدوس الأول',
          targetGroup: 'أساتذة التربية البدنية',
          notes: 'ستبرمج الأنشطة بمنطقتين تربويتين'
        },
        {
          id: 'a3-13',
          activityType: 'أنشطة أخرى',
          subject: 'تكوين في مجال التدريب للرياضات الجماعية',
          executionPeriod: 'الأسدوس الثاني',
          targetGroup: 'أساتذة التربية البدنية',
          notes: 'ستبرمج الأنشطة بمنطقتين تربويتين'
        }
      ]
    },
    {
      id: 'axis-4',
      title: 'المحور الرابع: البحث التربوي',
      activities: [
        {
          id: 'a4-1',
          activityType: 'المشاركة في الفريق الإقليمي للبحث التربوي .',
          subject: '',
          executionPeriod: 'طيلة السنة الدراسية',
          targetGroup: 'السلكان الثانوي التأهيلي والإعدادي',
          notes: 'بحوث فردية أو جماعية في إطار الفرق التربوية.'
        },
        {
          id: 'a4-2',
          activityType: 'رصد الحالات أو الظواهر التربوية التي تستلزم الدراسة الميدانية.',
          subject: '',
          executionPeriod: 'طيلة السنة الدراسية',
          targetGroup: 'السلكان الثانوي التأهيلي والإعدادي',
          notes: 'بحوث فردية أو جماعية في إطار الفرق التربوية.'
        },
        {
          id: 'a4-3',
          activityType: 'التنقيب عن المواهب الرياضية بالإقليم.',
          subject: '',
          executionPeriod: 'طيلة السنة الدراسية',
          targetGroup: 'تلاميذ المؤسسات التعليمية',
          notes: 'من خلال أنشطة الجمعيات الرياضية ومختلف بطولات الرياضة المدرسية .'
        }
      ]
    },
    {
      id: 'axis-5',
      title: 'المحور الخامس: التقويم و الامتحانات',
      activities: [
        {
          id: 'a5-1',
          activityType: 'تنظيم امتحانات البكالوريا احرار في مادة التربية البدنية.',
          subject: '',
          executionPeriod: 'حسب التاريخ المحدد (مارس أو أبريل)',
          targetGroup: 'المرشحون الأحرار للبكالوريا',
          notes: 'بتكليف'
        },
        {
          id: 'a5-2',
          activityType: 'مراقبة جودة الامتحانات الموحدة وامتحانات الباكالوريا.',
          subject: '',
          executionPeriod: 'وفق التاريخ المحدد',
          targetGroup: 'تلاميذ المؤسسات التعليمية',
          notes: 'بتكليف'
        }
      ]
    },
    {
      id: 'axis-6',
      title: 'المحور السادس: أنشطة أخرى',
      activities: [
        {
          id: 'a6-1',
          activityType: 'المشاركة في مختلف اللجن الإقليمية والجهوية.',
          subject: '',
          executionPeriod: 'خلال السنة الدراسية',
          targetGroup: '',
          notes: 'بتكليف'
        },
        {
          id: 'a6-2',
          activityType: 'المشاركة في مختلف الاجتماعات على صعيد المديرية والأكاديمية.',
          subject: '',
          executionPeriod: 'خلال السنة الدراسية',
          targetGroup: '',
          notes: ''
        }
      ]
    }
  ]
};
